let button = document.querySelector('.open-close-button');
let menu = document.querySelector('.nav-burger');

button.addEventListener('click', toggle);

function toggle() {
	button.classList.toggle("button-open");
    menu.classList.toggle("menu-open");
}

console.log('Score: 150 / 160');
console.log('вёрстка валидная (10/10)');
console.log('вёрстка семантическая (20/20): присутствуют теги HTML5 (header, main, footer, section, nav, figure, article) и заголовки (h1, h2, h3)');
console.log('используются css-стили (10/10)');
console.log('контент размещается в блоке, который горизонтально центрируется на странице; фоновый цвет тянется на всю ширину страницы (10/10)');
console.log('вёрстка адаптивная (10/10)');
console.log('адаптивное бургер-меню; ссылки в пунктах меню ведут на основные разделы CV; плавная прокрутка по якорям (10/10)');
console.log('присутствует фото; пропорции не искажены; есть атрибут alt (10/10)');
console.log('контакты и навыки оформлены в виде списка (10/10)');
console.log('содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского (10/10)');
console.log('пример кода с подсветкой (10/10)');
console.log('содержит изображение-ссылку на проект; при клике по изображению страница проекта открывается в новой вкладке; есть название, описание, перечень используемых технологий (10/10)');
console.log('выполнено на английском языке (10/10)');
console.log('выполнены требования к PR (10/10)');
console.log('нет видеорезюме (0/10)');
console.log('дизайн, оформление, качество выполнения (10/10)');